data_generation/simulation_results/case_62/constant/simParams
nIter 2000;
hComponent0 1910.7066447810425;
hComponent1 501.84837703645894;
hComponent2 4958.7272812656;
hComponent3 1675.5500246105378;
hComponent4 2006.5206062902862;kComponent0 99.94965507117091;
kComponent1 17.268659086162586;
kComponent2 55.30476361580758;
kComponent3 52.26424934087253;
kComponent4 87.59897056798202;
tAmbient 300;
Ux 2.0490073395072446;
kPCB 0.2632537953483248;